Revit 2026 API

# SketchedCurveSlopeOption Enumeration

---

The option determines the slop of the sketched run/landing.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum SketchedCurveSlopeOption
```
```vb
Public Enumeration SketchedCurveSlopeOption
```
```cpp
public enum class SketchedCurveSlopeOption
```
```fsharp
type SketchedCurveSlopeOption
```

| Member name | Value | Description |
| --- | --- | --- |
| Auto | 0 | The slope of the sketched run/landing will be auto detected. |
| Flat | 1 | The slope of the sketched run/landing will be kept flat. |
| Sloped | 2 | The slope of the sketched run/landing will be specified by users. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace